app/views/users/index.html.erb

      <%=it.username %><br>
      <%="Articles published: #{it.articles.length}" %>
---
SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 1]]