app/views/users/show.html.erb

<p><%= @user.email%></p>
<% @user.articles.each do |item| %>
---
SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 10]]