app/controllers/articles_controller.rb

    def index
        @article = Article.paginate(page: params[:page], per_page: 5)
---
SELECT "articles".* FROM "articles"
SELECT COUNT(*) FROM "articles"

    def create
        @article = Article.new(article_params)
        @article.user = User.first
        if @article.save
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
INSERT INTO "articles" ("title", "body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "Article 6"], ["body", "Article 6 body"], ["created_at", "2022-07-05 05:49:47.922840"], ["updated_at", "2022-07-05 05:49:47.922840"], ["user_id", 1]]